#Задача №333. Четные числа
#https://informatics.msk.ru/mod/statements/view.php?id=280#1
#Ввод и вывод данных производятся через стандартные потоки ввода-вывода. Для хранения целых чисел необходимо использовать 4-байтовые переменные (например, тип longint в Free Pascal).
#Входные данные
#Вводятся целые числа a и b. Гарантируется, что a не превосходит b
#Выходные данные
#Выведите (через пробел) все четные числа от a до b (включительно).
a=int(input("Введите целое число:\n"))
b=int(input("Введите ещё одно целое число:\n"))
if a>b:
	a,b=b,a
s=""
#my_list=list()
for i in range(a,b+1):
	if i % 2 == 0:
		#my_list.append(i)
#		if i == 0:
#			s=str(i)
#		else:
			s+=" "+str(i)
print("Чётные числа между ",a," и ",b,": ",s[1:],".",sep="")
input()
