#Задача №3644. Список степеней двойки
#https://informatics.msk.ru/mod/statements/view3.php?id=3751&chapterid=3644#1
#По данному числу N распечатайте все целые степени двойки, не превосходящие N, в порядке возрастания.
#Операцией возведения в степень пользоваться нельзя!
#
#Входные данные
#Вводится натуральное число.
#
#Выходные данные
#Выведите ответ на задачу.

n=int(input("Введите целое число: "))
s=""
i=1
while i<=n:
	s+=" "+str(i)
	i*=2
if len(s)>1:
	print("Список степеней двойки, равных от 1 до ", n, " (включительно): ",s[1:],".",sep="")
input()
