#Задача №3647. Утренняя пробежка
#https://informatics.msk.ru/mod/statements/view3.php?id=3751&chapterid=3647#1
#В первый день спортсмен пробежал x километров, а затем он каждый день увеличивал пробег на 10% от предыдущего значения. По данному числу y определите номер дня, на который пробег спортсмена составит не менее y километров.
#
#Входные данные
#Программа получает на вход действительные числа x и y
#
#Выходные данные
#Программа должна вывести одно натуральное число.

a=float(input("Введите число (начало интервала): "))
b=int(input("Введите целое число (конец интервала): "))
i=0
while a<=b:
	i+=1
	a=a+a*(i>1)*0.1
	#print(i,a,sep=None)
if i>1:
	print("Спортсмен пробежал расстояние ", b, " км на ", i, "-й день.", sep="")
input()
