#Задача №3533. Факториал
#https://informatics.msk.ru/mod/statements/view3.php?id=3457&chapterid=3533#1
#По данному целому неотрицательному n вычислите значение n!.
#N! = 1 * 2 * 3 * … * N (произведение всех чисел от 1 до N)
#0! = 1
#
#Входные данные
#Вводится число n.
#
#Выходные данные
#Выведите ответ на задачу.
#
n=int(input("Введите целое положительное число: "))
i=0
x=1
if n>=0:
	while i<n:
		i+=1
		x=x*i
		print(i,x)
	print("Факториал числа ", n, " (включительно) равен: ",x,sep="")
else:
	print("Ошибка! Введённое число ", n, " отрицательное. Выполнение программы остановлено.", sep="")
input()