#Задача №315. Сумма квадратов
#https://informatics.msk.ru/mod/statements/view.php?id=278#1
#Ввод и вывод данных производятся через стандартные потоки ввода-вывода.
#По данному натуральному n вычислите сумму 12+22+...+n2.
#Входные данные
#Вводится единственное натуральное число n, не превосходящее 100
#Выходные данные
#Необходимо вывести  вычисленную сумму.
n=int(input("Введите целое число (не больше 100) для расчёта суммы его квадратов:\n"))
if n<=100:
	my_result=0
	for i in range(n+1):
		my_result+=i**2
	print("Сумма квадратов число от 0 до ",n," включительно составляет ",my_result,".",sep="")
else:
	print("Ошибка! Введённое число ",n," превосходит 100. Выполнение программы остановлено.", sep="")
input()