#Задача №3535. Пингвины
#https://informatics.msk.ru/mod/statements/view3.php?id=3457&chapterid=3535#1
#Напишите программу, которая по данному числу n от 1 до 9 выводит на экран n пингвинов.
#Изображение одного пингвина имеет размер 5×9 символов, между двумя соседними пингвинами также имеется пустой (из пробелов) столбец.
#Разрешается вывести пустой столбец после последнего пингвина.
#Для упрощения рисования скопируйте пингвина из примера в среду разработки.
#   _~_    
#  (o o)   
# /  V  \  
#/(  _  )\ 
#  ^^ ^^   
#
#Входные данные
#Вводится натуральное число.
#
#Выходные данные
#Выведите ответ на задачу.
#
#Примечание
#Учтите, что вывод данных на экран производится построчно, а не попингвинно.
#
#В некоторых языках программирования символ обратного слэша “\” в текстовых строках имеет специальное значение.
#Чтобы включить в состав текстовой строки такой символ, его нужно повторить дважды.
#Например, для вывода на экран одного такого символа можно использовать такой код: print("\\").

n=int(input("Введите число пингвинов: "))
#print("   _~_    \n  (o o)   \n /  V  \  \n/(  _  )\ \n  ^^ ^^   ")
if n>=0:
	s="   _~_     "
	print(s*n)
	s="  (o o)    "
	print(s*n)
	s=" /  V  \   "
	print(s*n)
	s="/(  _  )\  "
	print(s*n)
	s="  ^^ ^^    "
	print(s*n)
else:
	print("Ошибка! Введённое число ", n, " отрицательное. Выполнение программы остановлено.", sep="")
input()