#Задача №3642. Список квадратов
#https://informatics.msk.ru/mod/statements/view3.php?id=3751&chapterid=3642#1
#По данному целому числу N распечатайте все квадраты натуральных чисел, не превосходящие N, в порядке возрастания.
#Входные данные
#Вводится натуральное число.
#Выходные данные
#Выведите ответ на задачу.

n=int(input("Введите целое число: "))
s=""
i=1
while i**2<n:
	s+=" "+str(i**2)
	i+=1
if len(s)>1:
	print("Квадраты целых чисел от 0 до ", n, " (включительно): ",s[1:],".",sep="")
input()