#Задача №3450. Квадрат числа.
#https://informatics.msk.ru/mod/statements/view3.php?id=3290&chapterid=3450#1
#Число 179 записали 50 раз подряд. Полученное 150-значное число возвели в квадрат. Сколько получилось?
x = str("179")
x = x * 50
x = int(x)
c = x ** 2
print("Квадрат числа:\n", x, "\n", "равен:\n", c, ".", sep = "")
input("Для завершения нажмите любую клавишу...")