#Задача №3458. Дележ яблок - 1 
#https://informatics.msk.ru/mod/statements/view3.php?id=3309&chapterid=3458#1
#n школьников делят k яблок поровну, неделящийся остаток остается в корзинке.
#Сколько яблок достанется каждому школьнику?
#
#Входные данные
#Программа получает на вход числа n и k - целые, положительные, не превышают 10000.
#
#Выходные данные
#Выведите ответ на задачу.

n = int(input("Введите число школьников: "))
k = int(input("Введите число яблок: "))
print("Каждый школьник получит яблок: ", k//n, ".", sep = "")
input("Для завершения нажмите любую клавишу...")