#Задача №3507. Сколько совпадает чисел
#https://informatics.msk.ru/mod/statements/view3.php?id=3380&chapterid=3507#1
#Даны три целых числа. Определите, сколько среди них совпадающих.
#Программа должна вывести одно из чисел:
#3 (если все совпадают),
#2 (если два совпадает)
#или 0 (если все числа различны).
#
#Входные данные
#Вводятся три целых числа.
#
#Выходные данные
#Выведите ответ на задачу.

x1 = 3
x2 = 3
x3 = 3

#x1 = int(input("Введите целое число 1: "))
#x2 = int(input("Введите целое число 2: "))
#x3 = int(input("Введите целое число 3: "))
x = {x1, x2, x3}

if len(x) == 1:
	x = 3
elif len(x) == 2:
	x = 2
elif len(x) == 3:
	x = 0
print("Одинаковых чисел - ", x, ".", sep = "")

input("Для завершения нажмите любую клавишу...")