#Задача №3610. Округление по российским правилам
#https://informatics.msk.ru/mod/statements/view3.php?id=3716&chapterid=3610#1
#По российский правилам числа округляются до ближайшего целого числа,
#а если дробная часть числа равна 0.5, то число округляется вверх.
#
#Дано неотрицательное число x, округлите его по этим правилам.
#Обратите внимание, что функция round не годится для этой задачи!
#
#Входные данные
#Вводится неотрицательное число.
#
#Выходные данные
#Выведите ответ на задачу.

n = float(input("Введите дробное неотрицательное число (разделитель - точка): "))
if n >= 0:
	x1 = int(n // 1)
	x2 = n - x1
	x3 = int(x2 >= 0.5)
	print(f"{x1 + x3}")
else:
	print("Ошибка! Было введено отрицательное значение!")
input("Для завершения нажмите любую клавишу...")
