#Задача №111301. Символ с данным ASCII-кодом
#https://informatics.msk.ru/mod/statements/view3.php?id=5761&chapterid=111301#1
#Считайте со стандартного ввода целое число и выведите ASCII-символ с таким кодом. Решите эту задачу с использованием только одной переменной типа int.
#Входные данные
#Программа получает на вход число от 33 до 126.
#Выходные данные
#Нужно вывести символ, который имеет введенный код
x=int(input("Введите код символа:\n"))
print("Символ с введённым кодом: ",chr(x))
x=input()
