#Задача №3502. Какое число больше?
#https://informatics.msk.ru/mod/statements/view3.php?id=3380&chapterid=3502#1
#Даны два целых числа. Программа должна вывести число 1, если первое число больше второго, число 2, если второе больше первого или число 0, если они равны.
#Входные данные
#Вводятся два целых числа.
#Выходные данные
#Выведите ответ на задачу.
#Примечание
#Эту задачу желательно решить с использованием каскадных инструкций if... elif... else.
x=int(input("Введите целое число 1:\n"))
y=int(input("Введите целое число 2:\n"))
if x>y:
	print(f"Число {x} больше")
elif x<y:
	print(f"Число {y} больше")
else:
	print("0")
x=input()
