#Задача №111300. ASCII-код символа
#https://informatics.msk.ru/mod/statements/view.php?id=5761#1
#Считайте со стандартного ввода символ и выведите его код.
#Входные данные
#Программа получает на вход один символ с кодом от 33 до 126.
#Выходные данные
#Нужно вывести одно число - код считанного символа
s=str(input("Введите символ:\n"))
print("Код введённого символа: ",ord(s))
x=input()