#Задача №3735. Делаем срезы
#https://informatics.msk.ru/mod/statements/view.php?id=3863#1
#На языке программирование Python нельзя использовать циклы.
#Входные данные
#Дана строка.
#Выходные данные
#Сначала выведите третий символ этой строки.
#Во второй строке выведите предпоследний символ этой строки.
#В третьей строке выведите первые пять символов этой строки.
#В четвертой строке выведите всю строку, кроме последних двух символов.
#В пятой строке выведите все символы с четными индексами (считая, что индексация начинается с 0, поэтому символы выводятся начиная с первого).
#В шестой строке выведите все символы с нечетными индексами, то есть начиная со второго символа строки.
#В седьмой строке выведите все символы в обратном порядке.
#В восьмой строке выведите все символы строки через один в обратном порядке, начиная с последнего.
#В девятой строке выведите длину данной строки.

#s=str(input("Введите текст:\n"))
s=str("Abrakadabra")
print("Исходная строка: ",s)
print("1. Третий символ строки: ",s[3]) 														#1
print("2. Предпоследний символ строки: ",s[-2])													#2
print("3. Первые пять символов строки: ",s[1-6])												#3
print("4. Вся строка, кроме последних двух символов: ",s[1::2])									#4
print("5. Все символы с четными индексами: ",s[0:-1:2])											#5
print("6. Все символы с нечетными индексами: ",s[1:-1:2])										#6
print("7. Все символы в обратном порядке: ",s[::-1])											#7
print("8. Все символы строки через один в обратном порядке, начиная с последнего: ",s[-1::-2])	#8
print("9. Длина строки: ",len(s)) 																#9
x=input()