#Задача №3443. A
#https://informatics.msk.ru/mod/statements/view.php?id=3290#1
#Вычислите 2 в степени 179. Выведите на экран вычисленное значение.
x=2**179
print(f"2 в степени 179 равно:\n{x}")
x=input()