#Задача №3736. Количество слов
#https://informatics.msk.ru/mod/statements/view3.php?id=3863&chapterid=3736#1
#Дана строка, состоящая из слов, разделенных ровно одним пробелом. Определите, сколько в ней слов.
#Используйте для решения задачи метод count.
s=str(input("Введите текст:\n"))
print("Количество слов в строке: ",s.count(" ")+1)
x=input()