#Задача №3445. Гипотенуза.
#https://informatics.msk.ru/mod/statements/view3.php?id=3290&chapterid=3445
#Вычислите длину гипотенузы в прямоугольном треугольнике со сторонами 179 и 971.
x=(179**2+971**2)**0.5
print(f"Гипотенуза прямоугольного треугольника со сторонами 179 и 971 составляет:\n{x}")
x=input()